[
  {
    "date": "22 June 2025",
    "topic": "Section 1 - Title, Extent and Commencement",
    "summary": "This Act is called the Bharatiya Nagarik Suraksha Sanhita, 2023. It does not apply to Nagaland and tribal areas unless the State Government decides to apply it by official notification.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "23 June 2025",
    "topic": "Section 2 - Key Definitions",
    "summary": "Defines important terms like 'audio-video electronic means' which includes video calls for evidence or search. Also defines 'bail' as conditional release from custody.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "24 June 2025",
    "topic": "Section 3 - Construction of References",
    "summary": "Any mention of laws like IPC or CrPC will now be read as references to Bharatiya Nyaya Sanhita and this Act (BNSS), unless specified otherwise.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "25 June 2025",
    "topic": "Section 4 - Trial of Offences",
    "summary": "All offences under the Bharatiya Nyaya Sanhita will be investigated and tried as per this Sanhita unless stated otherwise.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "26 June 2025",
    "topic": "Section 5 - Saving of Other Laws",
    "summary": "This Act doesn't affect any special laws or powers given by other laws. Offences under other laws can still be handled under their own procedures.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "27 June 2025",
    "topic": "Section 6 - Classes of Criminal Courts",
    "summary": "Lists 4 types of criminal courts: Sessions Judges, Judicial Magistrates (First and Second Class), and Executive Magistrates.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "28 June 2025",
    "topic": "Section 7 - Territorial Jurisdiction",
    "summary": "Explains where each court has the authority to conduct trials, based on territory and law.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "29 June 2025",
    "topic": "Section 8 - Metropolitan Areas",
    "summary": "State Governments can declare cities with over 10 lakh population as 'Metropolitan Areas' for court jurisdiction.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "30 June 2025",
    "topic": "Section 9 - Establishment of Sessions Courts",
    "summary": "State Governments must set up Sessions Courts for each sessions division. High Courts appoint judges here.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "01 July 2025",
    "topic": "Section 10 - Assistant Sessions Judges",
    "summary": "State Government can appoint Assistant Sessions Judges in consultation with the High Court.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "03 July 2025",
    "topic": "Section 11",
    "summary": "and every other Judicial Magistrate will, subject to the general control of the Sessions Judge, be subordinate to the Chief Judicial Magistrate. The Chief Judicial Magistrate may, from time to time, make rules or give special orders, consistent with this Sanhita, as to the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "04 July 2025",
    "topic": "Section 12",
    "summary": "thinks fit to be Executive Magistrates and will appoint one of them to be the District Magistrate. The State Government may appoint any Executive Magistrate to be an Additional District Magistrate, and such Magistrate will have such of the powers of a District Magistrate.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "05 July 2025",
    "topic": "Section 13",
    "summary": "from time to time, define the local limits of the areas within which the Executive Magistrates may exercise all or any of the powers with which they may be invested under this Sanhita. Local Jurisdiction of Executive Magistrates. Except as otherwise provided by such.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "06 July 2025",
    "topic": "Section 14",
    "summary": "every Executive Magistrate exercising powers in a sub-division will also be subordinate to the Sub-divisional Magistrate, subject, to the general control of the District Magistrate. Subordination of Executive Magistrates. The District Magistrate may, from time to time, make.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "07 July 2025",
    "topic": "Section 15",
    "summary": "after consultation with the High Court, appoint a Public Prosecutor and may also appoint one or more Additional Public Prosecutors, for conducting in such Court, any prosecution, appeal or other proceeding on behalf of the Central Government or the State Government, as the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "08 July 2025",
    "topic": "Section 16",
    "summary": "Public Prosecutors for conducting prosecutions in the Courts of Magistrates. The Central Government may appoint one or more Assistant Public Prosecutors for the purpose of conducting any case or class of cases in the Courts of Magistrates. Without prejudice to provisions.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "09 July 2025",
    "topic": "Section 17",
    "summary": "a Directorate of Prosecution in the State consisting of a Director of Prosecution and as many Deputy Directors of Prosecution as it thinks fit; and a District Directorate of Prosecution in every district consisting of as many Deputy Directors and Assistant Directors of.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "10 July 2025",
    "topic": "Section 18",
    "summary": "A Sessions Judge or Additional Sessions Judge may pass any sentence authorised by law; but any sentence of death passed by any such Judge will be subject to confirmation by the High Court.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "11 July 2025",
    "topic": "Section 19",
    "summary": "law except a sentence of death or of imprisonment for life or of imprisonment for a term exceeding seven years. The Court of a Magistrate of the first class may pass a sentence of imprisonment for a term not exceeding three years, or of fine not exceeding fifty thousand.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "12 July 2025",
    "topic": "Section 20",
    "summary": "payment of fine as is authorised by law: Provided that the term— is not in excess of the powers of the Magistrate under section 23; will not, where imprisonment has been awarded as part of the substantive sentence, exceed one-fourth of the term of imprisonment which the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "13 July 2025",
    "topic": "Section 21",
    "summary": "subject to the provisions of section 9 of the Bharatiya Nyaya Sanhita, 2023, sentence him for such offences, to the several punishments prescribed therefor which such Court is competent to inflict and the Court will, considering the gravity of offences, order such punishments.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "14 July 2025",
    "topic": "Section 22",
    "summary": "as the case may be, may, by order, empower persons specially by name or in virtue of their offices or classes of officials generally be their official titles. Every such order will take effect from the date on which it is communicated to the person so empowered. Powers of.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "15 July 2025",
    "topic": "Section 23",
    "summary": "or any of the powers conferred by it under this Sanhita on any person or by any officer subordinate to it. Withdrawal of powers. Any powers conferred by the Chief Judicial Magistrate or by the District Magistrate may be withdrawn by the respective Magistrate by whom such.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "16 July 2025",
    "topic": "Section 24",
    "summary": "Judge or Magistrate may be exercised or performed by his successor-in-office. When there is any doubt as to who is the successor-in-office, the Sessions Judge will determine by order in writing the Judge who will, for the purposes of this Sanhita or of any proceedings or.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "17 July 2025",
    "topic": "Section 25",
    "summary": "person to commit, any offence punishable under any of the following sections of the Bharatiya Nyaya Sanhita, 2023, namely:— Public to give information of certain offences. sections 103 to 105 ; sections 111 to 113 ; sections 140 to 144 ; sections 147 to 154 and section 158;.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "18 July 2025",
    "topic": "Section 26",
    "summary": "person residing in a village will forthwith communicate to the nearest Magistrate or to the officer in charge of the nearest police station, whichever is nearer, any information which he may possess respecting— the permanent or temporary residence of any notorious receiver or.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "19 July 2025",
    "topic": "Section 27",
    "summary": "warrant, arrest any person— who commits, in the presence of a police officer, a cognizable offence; or against whom a reasonable complaint has been made, or credible information has been received, or a reasonable suspicion exists that he has committed a cognizable offence.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "20 July 2025",
    "topic": "Section 28",
    "summary": "has been accused of committing a non-cognizable offence refuses on demand of such officer to give his name and residence or gives a name or residence which such officer has reason to believe to be false, he may be arrested by such officer in order that his name or residence.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "21 July 2025",
    "topic": "Section 29",
    "summary": "presence commits a non-bailable and cognizable offence, or any proclaimed offender, and, without unnecessary delay, but within six hours from such arrest, will make over or cause to be made over any person so arrested to a police officer, or, in the absence of a police.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "22 July 2025",
    "topic": "Section 30",
    "summary": "Executive or Judicial, within his local jurisdiction, he may himself arrest or order any person to arrest the offender, and may thereupon, subject to the provisions herein contained as to bail, commit the offender to custody. Arrest by Magistrate. Any Magistrate, whether.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "23 July 2025",
    "topic": "Section 31",
    "summary": "inclusive), no member of the Armed Forces of the Union will be arrested for anything done or purported to be done by him in the discharge of his official duties except after obtaining the consent of the Central Government. The State Government may, by notification, direct.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "24 July 2025",
    "topic": "Section 32",
    "summary": "actually touch or confine the body of the person to be arrested, unless there be a submission to the custody by word or action: Provided that where a woman is to be arrested, unless the circumstances indicate to the contrary, her submission to custody on an oral intimation of.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "25 July 2025",
    "topic": "Section 33",
    "summary": "authority to arrest, has reason to believe that the person to be arrested has entered into, or is within, any place, any person residing in, or being in charge of, such place will, on demand of such person acting as aforesaid or such police officer, allow him free ingress.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "26 July 2025",
    "topic": "Section 34",
    "summary": "forthwith communicate to him full particulars of the offence for which he is arrested or other grounds for such arrest. Person arrested to be informed of grounds of arrest and of right to bail. Where a police officer arrests without warrant any person other than a person.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "27 July 2025",
    "topic": "Section 35",
    "summary": "forthwith give the information regarding such arrest and place where the arrested person is being held to any of his relatives, friends or such other persons as may be disclosed or nominated by the arrested person for the purpose of giving such information and also to the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "28 July 2025",
    "topic": "Section 36",
    "summary": "a person is arrested by a police officer under a warrant which does not provide for the taking of bail, or under a warrant which provides for the taking of bail but the person arrested cannot furnish bail; and Search of arrested person. a person is arrested without warrant,.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "29 July 2025",
    "topic": "Section 37",
    "summary": "nature and alleged to have been committed under such circumstances that there are reasonable grounds for believing that an examination of his person will afford evidence as to the commission of an offence, it will be lawful for a registered medical practitioner, acting at the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "30 July 2025",
    "topic": "Section 38",
    "summary": "attempt to commit rape and there are reasonable grounds for believing that an examination of his person will afford evidence as to the commission of such offence, it will be lawful for a registered medical practitioner employed in a hospital run by the Government or by a.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "31 July 2025",
    "topic": "Section 39",
    "summary": "service of the Central Government or a State Government, and in case the medical officer is not available, by a registered medical practitioner soon after the arrest is made: 30 of 2019. Sec. 1] THE GAZETTE OF INDIA EXTRAORDINARY 19.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "01 August 2025",
    "topic": "Section 40",
    "summary": "investigation under Chapter XIII requires any officer subordinate to him to arrest without a warrant any person who may lawfully be arrested without a warrant, he will deliver to the officer required to make the arrest an order in writing, specifying the person to be arrested.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "02 August 2025",
    "topic": "Section 41",
    "summary": "custody he escaped or was rescued may immediately pursue and arrest him in any place in India. The provisions of section 44 will apply to arrests under sub-section although the person making any such arrest is not acting under a warrant and is not a police officer having.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "03 August 2025",
    "topic": "Section 42",
    "summary": "the State Government may make in this behalf, by an officer of the Court issuing it or other public servant: Provided that the police station or the registrar in the Court will maintain a register to enter the address, email address, phone number and such other details as the.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "04 August 2025",
    "topic": "Section 43",
    "summary": "it on the Director, Manager, Secretary or other officer of the company or corporation, or by letter sent by registered post addressed to the Director, Manager, Secretary or other officer of the company or corporation in India, in which case the service will be deemed to have.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "05 August 2025",
    "topic": "Section 44",
    "summary": "Court issuing the summons will ordinarily send it in duplicate to the head of the office in which such person is employed; and such head will thereupon cause the summons to be served in the manner provided by section 64, and will return it to the Court under his signature.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "06 August 2025",
    "topic": "Section 45",
    "summary": "in any case where the officer who has served a summons is not present at the hearing of the case, an affidavit, purporting to be made before a Magistrate, that such summons has been served, and a duplicate of the summons purporting to be endorsed by the person to whom it was.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "07 August 2025",
    "topic": "Section 46",
    "summary": "a Court issuing a summons to a witness may, in addition to and simultaneously with the issue of such summons, direct a copy of the summons to be served by electronic communication or by registered post addressed to the witness at the place where he ordinarily resides or.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "08 August 2025",
    "topic": "Section 47",
    "summary": "signed by the presiding officer of such Court and will bear the seal of the Court. Form of warrant of arrest and duration. 22 THE GAZETTE OF INDIA EXTRAORDINARY [Part II— ___________________________________________________________.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "09 August 2025",
    "topic": "Section 48",
    "summary": "direct by endorsement on the warrant that, if such person executes a bail bond with sufficient sureties for his attendance before the Court at a specified time and thereafter until otherwise directed by the Court, the officer to whom the warrant is directed will take such.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "10 August 2025",
    "topic": "Section 49",
    "summary": "but the Court issuing such a warrant may, if its immediate execution is necessary and no police officer is immediately available, direct it to any other person or persons, and such person or persons will execute the same. When a warrant is directed to more officers or persons.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  },
  {
    "date": "11 August 2025",
    "topic": "Section 50",
    "summary": "warrant to any person within his local jurisdiction for the arrest of any escaped convict, proclaimed offender or of any person who is accused of a non-bailable offence and is evading arrest. Such person will acknowledge in writing the receipt of the warrant, and will execute.",
    "source": "Bharatiya Nagarik Suraksha Sanhita, 2023"
  }
]
